way4-db-analyzer-extracted/scripts/temp_parent_test.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsin="http://www.openwaygroup.com/wsint">
   <soapenv:Header>
      <wsin:SessionContextStr></wsin:SessionContextStr>
      <wsin:UserInfo>officer="WX_ADMIN"</wsin:UserInfo>
      <wsin:CorrelationId></wsin:CorrelationId>
   </soapenv:Header>
   <soapenv:Body>
      <wsin:CreateContractV4>
         <wsin:ClientSearchMethod>CLIENT_ID</wsin:ClientSearchMethod>
         <wsin:ClientIdentifier>96100</wsin:ClientIdentifier>
         <wsin:Reason>Create Terminal for Acquirer Test</wsin:Reason>
         <wsin:CreateContract_InObject>
            <wsin:Branch>0101</wsin:Branch>
            <wsin:InstitutionCode>0001</wsin:InstitutionCode>
            <wsin:ProductCode>RETAIL_TERMINAL</wsin:ProductCode>
            <wsin:ProductCode2></wsin:ProductCode2>
            <wsin:ProductCode3></wsin:ProductCode3>
            <wsin:ContractName>Retail POS Terminal 01</wsin:ContractName>
            <wsin:CBSNumber>21324556600</wsin:CBSNumber>   
            <wsin:BillingContract>001-C-508109</wsin:BillingContract>
         </wsin:CreateContract_InObject>
      </wsin:CreateContractV4>
   </soapenv:Body>
</soapenv:Envelope>
